ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/AM263X/ICSSM_ICSSM_PR1_PROTECT_SLV_48024C00h.xml
<module name="ICSSM_PR1_PROTECT_SLV" acronym="" XML_version="1.0" HW_revision="n/a" description="">
	<register id="ICSSM_PR1_PROTECT_SLV_UNLOCK_KEY" acronym="ICSSM_PR1_PROTECT_SLV_UNLOCK_KEY" offset="0" width="32" description="">
		<bitfield id="UNLOCK_KEY" width="32" begin="31" end="0" resetval="0x0" description="UnLock Key Pattern 0x83E7_0B13 to UnLock 0x0000_0000 to Lock Must unlock to update MMRs" range="31:0" rwaccess="R/W"/>
	</register><register id="ICSSM_PR1_PROTECT_SLV_CFG" acronym="ICSSM_PR1_PROTECT_SLV_CFG" offset="4" width="32" description="Config.">
		<bitfield id="PRU1_DMEM1_LOCK_EN" width="1" begin="6" end="6" resetval="0x0" description="Write Protect DMEM10:disable1:enable When enabled only PRU1 can write to DMEM1" range="6" rwaccess="R/W"/>
	<bitfield id="PRU0_DMEM0_LOCK_EN" width="1" begin="5" end="5" resetval="0x0" description="Write Protect DMEM00:disable1:enable When enabled only PRU0 can write to DMEM0" range="5" rwaccess="R/W"/>
	<bitfield id="ICSS_CFG_WP_EN" width="1" begin="4" end="4" resetval="0x0" description="Write Protect ICSS_CFG0:disable1:enable" range="4" rwaccess="R/W"/>
	<bitfield id="RTU1_PRU_WP_EN" width="1" begin="3" end="3" resetval="0x0" description="Write Protect RTU1_PRU access Debug IMEM0:disable1:enable" range="3" rwaccess="R/W"/>
	<bitfield id="RTU0_PRU_WP_EN" width="1" begin="2" end="2" resetval="0x0" description="Write Protect RTU0_PRU access Debug IMEM0:disable1:enable" range="2" rwaccess="R/W"/>
	<bitfield id="PRU1_WP_EN" width="1" begin="1" end="1" resetval="0x0" description="Write Protect PRU1 access Debug IMEM0:disable1:enable" range="1" rwaccess="R/W"/>
	<bitfield id="PRU0_WP_EN" width="1" begin="0" end="0" resetval="0x0" description="Write Protect PRU0 access Debug IMEM0:disable1:enable" range="0" rwaccess="R/W"/>
	</register>
</module>